xdu-aero-association/FM33LC0XX_Example_0.04/SPI 主机中断示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_lptim.h
/**
  * @brief    Get Channel 1 Over-Capture Interrupt Enable Status
  * @rmtoll   IER    OVR1IE    LL_LPTIM_IsEnabled_CAP1OVR
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabled_CAP1OVR(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->IER, LPTIM_IER_OVR1IE_Msk) == LPTIM_IER_OVR1IE_Msk);
}

/**
  * @brief    Get Channel 2 Over-Capture Interrupt Enable Status
  * @rmtoll   IER    OVR2IE    LL_LPTIM_IsEnabled_CAP2OVR
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabled_CAP2OVR(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->IER, LPTIM_IER_OVR2IE_Msk) == LPTIM_IER_OVR2IE_Msk);
}

/**
  * @brief    Get Capture/Compare channel 1 Interrupt Flag
  * @rmtoll   ISR    CC1IF    LL_LPTIM_IsActiveFlag_Channel1
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_Channel1(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->ISR, LPTIM_ISR_CC1IF_Msk) == (LPTIM_ISR_CC1IF_Msk));
}

/**
  * @brief    Get Capture/Compare channel 2 Interrupt Flag
  * @rmtoll   ISR    CC2IF    LL_LPTIM_IsActiveFlag_Channel2
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_Channel2(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->ISR, LPTIM_ISR_CC2IF_Msk) == (LPTIM_ISR_CC2IF_Msk));
}

/**
  * @brief    Get Counter Over-Flow Interrupt Flag
  * @rmtoll   ISR    OVIF    LL_LPTIM_IsActiveFlag_CounterOver
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CounterOver(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->ISR, LPTIM_ISR_OVIF_Msk) == (LPTIM_ISR_OVIF_Msk));
}

/**
  * @brief    Get External Trigger Interrupt Flag
  * @rmtoll   ISR    TRIGIF    LL_LPTIM_IsActiveFlag_ExternalTrigger
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_ExternalTrigger(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->ISR, LPTIM_ISR_TRIGIF_Msk) == (LPTIM_ISR_TRIGIF_Msk));
}

/**
  * @brief    Get Channel 1 Over-Capture Interrupt Flag
  * @rmtoll   ISR    CAP1OVR    LL_LPTIM_IsActiveFlag_CAP1OVR
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CAP1OVR(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->ISR, LPTIM_ISR_CAP1OVR_Msk) == (LPTIM_ISR_CAP1OVR_Msk));
}

/**
  * @brief    Get Channel 2 Over-Capture Interrupt Flag
  * @rmtoll   ISR    CAP2OVR    LL_LPTIM_IsActiveFlag_CAP2OVR
  * @param    LPTIMx LPTIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CAP2OVR(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->ISR, LPTIM_ISR_CAP2OVR_Msk) == (LPTIM_ISR_CAP2OVR_Msk));
}

/**
  * @brief    Clear Capture/Compare channel 1 Interrupt Flag
  * @rmtoll   ISR    CC1IF    LL_LPTIM_ClearFlag_Channel1
  * @param    LPTIMx LPTIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_Channel1(LPTIM_Type *LPTIMx)
{
    WRITE_REG(LPTIMx->ISR, LPTIM_ISR_CC1IF_Msk);
}

/**
  * @brief    Clear Capture/Compare channel 2 Interrupt Flag
  * @rmtoll   ISR    CC2IF    LL_LPTIM_ClearFlag_Channel2
  * @param    LPTIMx LPTIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_Channel2(LPTIM_Type *LPTIMx)
{
    WRITE_REG(LPTIMx->ISR, LPTIM_ISR_CC2IF_Msk);
}

/**
  * @brief    Clear Counter Over-Flow Interrupt Flag
  * @rmtoll   ISR    OVIF    LL_LPTIM_ClearFlag_CounterOver
  * @param    LPTIMx LPTIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CounterOver(LPTIM_Type *LPTIMx)
{
    WRITE_REG(LPTIMx->ISR, LPTIM_ISR_OVIF_Msk);
}

/**
  * @brief    Clear External Trigger Interrupt Flag
  * @rmtoll   ISR    TRIGIF    LL_LPTIM_ClearFlag_ExternalTrigger
  * @param    LPTIMx LPTIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_ExternalTrigger(LPTIM_Type *LPTIMx)
{
    WRITE_REG(LPTIMx->ISR, LPTIM_ISR_TRIGIF_Msk);
}

/**
  * @brief    Clear Channel 1 Over-Capture Interrupt Flag
  * @rmtoll   ISR    CAP1OVR    LL_LPTIM_ClearFlag_CAP1OVR
  * @param    LPTIMx LPTIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CAP1OVR(LPTIM_Type *LPTIMx)
{
    WRITE_REG(LPTIMx->ISR, LPTIM_ISR_CAP1OVR_Msk);
}

/**
  * @brief    Clear Channel 2 Over-Capture Interrupt Flag
  * @rmtoll   ISR    CAP2OVR    LL_LPTIM_ClearFlag_CAP2OVR
  * @param    LPTIMx LPTIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CAP2OVR(LPTIM_Type *LPTIMx)
{
    WRITE_REG(LPTIMx->ISR, LPTIM_ISR_CAP2OVR_Msk);
}

/**
  * @brief    Set Auto-Reload Register
  * @rmtoll   ARR        LL_LPTIM_SetAutoReload
  * @param    LPTIMx LPTIM instance
  * @param    AutoReload 
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_SetAutoReload(LPTIM_Type *LPTIMx, uint32_t AutoReload)
{
    MODIFY_REG(LPTIMx->ARR, (0xffffffffU << 0U), (AutoReload << 0U));
}

/**
  * @brief    Get Auto-Reload Register
  * @rmtoll   ARR        LL_LPTIM_GetAutoReload
  * @param    LPTIMx LPTIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetAutoReload(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->ARR, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set Channel 1 Capture edge Config
  * @rmtoll   CCSR    CAPCFG1    LL_LPTIM_IC_SetPolarityChannel1
  * @param    LPTIMx LPTIM instance
  * @param    Polarity This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_RISING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_FALLING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_BOTHEDGE
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_IC_SetPolarityChannel1(LPTIM_Type *LPTIMx, uint32_t Polarity)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_CAPCFG1_Msk, Polarity << LPTIM_CCSR_CAPCFG1_Pos);
}

/**
  * @brief    Get Channel 1 Capture edge Config
  * @rmtoll   CCSR    CAPCFG1    LL_LPTIM_IC_GetPolarityChannel1
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_RISING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_FALLING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_BOTHEDGE
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetPolarityChannel1(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CAPCFG1_Msk) >> LPTIM_CCSR_CAPCFG1_Pos);
}

/**
  * @brief    Set Channel 2 Capture edge Config
  * @rmtoll   CCSR    CAPCFG2    LL_LPTIM_IC_SetPolarityChannel2
  * @param    LPTIMx LPTIM instance
  * @param    Polarity This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_RISING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_FALLING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_BOTHEDGE
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_IC_SetPolarityChannel2(LPTIM_Type *LPTIMx, uint32_t Polarity)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_CAPCFG2_Msk, Polarity<<LPTIM_CCSR_CAPCFG2_Pos);
}

/**
  * @brief    Get Channel 2 Capture edge Config
  * @rmtoll   CCSR    CAPCFG2    LL_LPTIM_IC_GetPolarityChannel2
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_RISING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_FALLING
  *           @arg @ref LL_LPTIM_IC_POLARITY_EDGE_BOTHEDGE
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetPolarityChannel2(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CAPCFG2_Msk)>>LPTIM_CCSR_CAPCFG2_Pos);
}

/**
  * @brief    Set Channel 1 compare output Polarity
  * @rmtoll   CCSR    POLAR1    LL_LPTIM_OC_SetPolarityChannel1
  * @param    LPTIMx LPTIM instance
  * @param    Polarity This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_OC_POLARITY_LOW_TO_HIGH
  *           @arg @ref LL_LPTIM_OC_POLARITY_HIGH_TO_LOW
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_OC_SetPolarityChannel1(LPTIM_Type *LPTIMx, uint32_t Polarity)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_POLAR1_Msk, Polarity << LPTIM_CCSR_POLAR1_Pos);
}

/**
  * @brief    Get Channel 1 compare output Polarity
  * @rmtoll   CCSR    POLAR1    LL_LPTIM_OC_GetPolarityChannel1
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_OC_POLARITY_LOW_TO_HIGH
  *           @arg @ref LL_LPTIM_OC_POLARITY_HIGH_TO_LOW
  */
__STATIC_INLINE uint32_t LL_LPTIM_OC_GetPolarityChannel1(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_POLAR1_Msk) >>LPTIM_CCSR_POLAR1_Pos );
}

/**
  * @brief    Set Channel 2 compare output Polarity
  * @rmtoll   CCSR    POLAR2    LL_LPTIM_OC_SetPolarityChannel2
  * @param    LPTIMx LPTIM instance
  * @param    Polarity This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_OC_POLARITY_LOW_TO_HIGH
  *           @arg @ref LL_LPTIM_OC_POLARITY_HIGH_TO_LOW
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_OC_SetPolarityChannel2(LPTIM_Type *LPTIMx, uint32_t Polarity)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_POLAR2_Msk, Polarity << LPTIM_CCSR_POLAR2_Pos);
}

/**
  * @brief    Get Channel 2 compare output Polarity
  * @rmtoll   CCSR    POLAR2    LL_LPTIM_OC_GetPolarityChannel2
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_OC_POLARITY_LOW_TO_HIGH
  *           @arg @ref LL_LPTIM_OC_POLARITY_HIGH_TO_LOW
  */
__STATIC_INLINE uint32_t LL_LPTIM_OC_GetPolarityChannel2(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_POLAR2_Msk) >> LPTIM_CCSR_POLAR2_Pos);
}

/**
  * @brief    Set Channel 2 Capture/Compare Select
  * @rmtoll   CCSR    CC2S    LL_LPTIM_CC_Set_ModeChannel2
  * @param    LPTIMx LPTIM instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_CC_MODE_NONE
  *           @arg @ref LL_LPTIM_CC_MODE_CAPTURE
  *           @arg @ref LL_LPTIM_CC_MODE_COMPARE
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_CC_Set_ModeChannel2(LPTIM_Type *LPTIMx, uint32_t Mode)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_CC2S_Msk, Mode << LPTIM_CCSR_CC2S_Pos);
}

/**
  * @brief    Get Channel 2 Capture/Compare Select
  * @rmtoll   CCSR    CC2S    LL_LPTIM_CC_Get_ModeChannel2
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_CC_MODE_NONE
  *           @arg @ref LL_LPTIM_CC_MODE_CAPTURE
  *           @arg @ref LL_LPTIM_CC_MODE_COMPARE
  */
__STATIC_INLINE uint32_t LL_LPTIM_CC_Get_ModeChannel2(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CC2S_Msk) >> LPTIM_CCSR_CC2S_Pos);
}

/**
  * @brief    Set Channel 1 Capture/Compare Select 
  * @rmtoll   CCSR    CC1S    LL_LPTIM_CC_Set_ModeChannel1
  * @param    LPTIMx LPTIM instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_CC_MODE_NONE
  *           @arg @ref LL_LPTIM_CC_MODE_CAPTURE
  *           @arg @ref LL_LPTIM_CC_MODE_COMPARE
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_CC_Set_ModeChannel1(LPTIM_Type *LPTIMx, uint32_t Mode)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_CC1S_Msk, Mode << LPTIM_CCSR_CC1S_Pos );
}

/**
  * @brief    Get Channel 1 Capture/Compare Select 
  * @rmtoll   CCSR    CC1S    LL_LPTIM_CC_Get_ModeChannel1
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_CC_MODE_NONE
  *           @arg @ref LL_LPTIM_CC_MODE_CAPTURE
  *           @arg @ref LL_LPTIM_CC_MODE_COMPARE
  */
__STATIC_INLINE uint32_t LL_LPTIM_CC_Get_ModeChannel1(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CC1S_Msk)>>LPTIM_CCSR_CC1S_Pos);
}

/**
  * @brief    Get Channel 1 Captured Edge
  * @rmtoll   CCSR    CAP1EDGE    LL_LPTIM_IC_GetCapcturedEdgeChannel1
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_IC_CAPCTURED_EDGE_FALLING
  *           @arg @ref LL_LPTIM_IC_CAPCTURED_EDGE_RISING
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetCapcturedEdgeChannel1(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CAP1EDGE_Msk) >> LPTIM_CCSR_CAP1EDGE_Pos);
}

/**
  * @brief    Get Channel2 Captured Edge
  * @rmtoll   CCSR    CAP2EDGE    LL_LPTIM_IC_GetCapcturedEdgeChannel2
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_IC_CAPCTURED_EDGE_FALLING
  *           @arg @ref LL_LPTIM_IC_CAPCTURED_EDGE_RISING
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetCapcturedEdgeChannel2(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CAP2EDGE_Msk) >> LPTIM_CCSR_CAP2EDGE_Pos);
}

/**
  * @brief    Set Channel 1 Capture Source Select
  * @rmtoll   CCSR    CAP1SSEL    LL_LPTIM_IC_SetCapctureSourceChannel1
  * @param    LPTIMx LPTIM instance
  * @param    CaptureSource This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_CHANNEL1
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_XTLF
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_RCLP
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_RC4M_PSC
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_IC_SetCapctureSourceChannel1(LPTIM_Type *LPTIMx, uint32_t CaptureSource)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_CAP1SSEL_Msk, CaptureSource);
}

/**
  * @brief    Get Channel 1 Capture Source Select
  * @rmtoll   CCSR    CAP1SSEL    LL_LPTIM_IC_GetCapctureSourceChannel1
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_CHANNEL1
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_XTLF
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_RCLP
  *           @arg @ref LL_LPTIM_IC1_CAPCTURE_SOURCE_RC4M_PSC
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetCapctureSourceChannel1(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CAP1SSEL_Msk));
}

/**
  * @brief    Set Channel 2 Capture Source Select
  * @rmtoll   CCSR    CAP2SSEL    LL_LPTIM_IC_SetCapctureSourceChannel2
  * @param    LPTIMx LPTIM instance
  * @param    CaptureSource This parameter can be one of the following values:
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_GPTIM1_TRGO
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_GPTIM2_TRGO
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_ATIM_TRGO
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_CHANNEL2
  * @retval   None
  */
__STATIC_INLINE void LL_LPTIM_IC_SetCapctureSourceChannel2(LPTIM_Type *LPTIMx, uint32_t CaptureSource)
{
    MODIFY_REG(LPTIMx->CCSR, LPTIM_CCSR_CAP2SSEL_Msk, CaptureSource);
}

/**
  * @brief    Get Channel 2 Capture Source Select
  * @rmtoll   CCSR    CAP2SSEL    LL_LPTIM_IC_GetCapctureSourceChannel2
  * @param    LPTIMx LPTIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_GPTIM1_TRGO
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_GPTIM2_TRGO
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_ATIM_TRGO
  *           @arg @ref LL_LPTIM_IC2_CAPCTURE_SOURCE_CHANNEL2
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetCapctureSourceChannel2(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CCSR, LPTIM_CCSR_CAP2SSEL_Msk));
}

/**
  * @brief    Get 32bits-wide Current Counter 
  * @rmtoll   CNT        LL_LPTIM_GetCounter
  * @param    LPTIMx LPTIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetCounter(LPTIM_Type *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CNT, 0xffffffffU) >> 0U);
}

/**
  * @}
  */

/** @defgroup LPTIM_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_LPTIM_DeInit(LPTIM_Type *LPTIMx);
void LL_LPTIM_ICModeStructInit(LL_TIM_IC_InitTypeDef *LPTIM_InitStruct);
void LL_LPTIM_OCModeStructInit(LL_TIM_OC_InitTypeDef *LPTIM_InitStruct);
void LL_LPTIM_TimeModeStructInit(LL_LPTIM_TimeInitTypeDef *LPTIM_InitStruct);
ErrorStatus LL_LPTIM_TimeModeInit(LPTIM_Type *LPTIMx, LL_LPTIM_TimeInitTypeDef *LPTIM_InitStruct);
ErrorStatus LL_LPTIM_IC_ModeInit(LPTIM_Type *LPTIMx,uint32_t Channel, LL_TIM_IC_InitTypeDef *LPTIM_InitStruct);
ErrorStatus LL_LPTIM_OC_ModeInit(LPTIM_Type *LPTIMx,uint32_t Channel, LL_TIM_OC_InitTypeDef *LPTIM_InitStruct);
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_LPTIM_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-12-02**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
